soap/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


vertices
(
    (0 0 0)     // vertex 0
    (4 0 0)     // vertex 1
    (4 4 0)     // vertex 2
    (0 4 0)     // vertex 3
    (0 0 0.1)   // vertex 4
    (4 0 0.1)   // vertex 5
    (4 4 0.1)   // vertex 6
    (0 4 0.1)   // vertex 7
);

blocks
(
    // 1 block, subdivided into 80 x 80 x 1 cells
    hex (0 1 2 3 4 5 6 7) (80 80 1) simpleGrading (1 1 1)
);

edges
(
    // no special edges
);

boundary
(
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            (3 0 4 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
